In [1]:
import pandas as pd
  
# creating and initializing a list
values= [['Rohan',455],['Elvish',250],['Deepak',495],
         ['Soni',400],['Radhika',350],['Vansh',450]]
 
# creating a pandas dataframe
df = pd.DataFrame(values,columns=['Name','Total_Marks'])

In [2]:
df

      Name  Total_Marks
0    Rohan          455
1   Elvish          250
2   Deepak          495
3     Soni          400
4  Radhika          350
5    Vansh          450

In [8]:
df["hello"] = df.apply(lambda x:(x['Total_Marks']/500*100),axis = 1)

In [9]:
df

      Name  Total_Marks  Percentage  hello
0    Rohan          455        91.0   91.0
1   Elvish          250        50.0   50.0
2   Deepak          495        99.0   99.0
3     Soni          400        80.0   80.0
4  Radhika          350        70.0   70.0
5    Vansh          450        90.0   90.0

In [ ]:
def get_products_in_adgroup(account):
    products_data = db.report_records.aggregate([
    {
        "$match": {
            "account_id": str(account),
            "dt": {
                "$gte": datetime.datetime.now() - datetime.timedelta(days=30),
                "$lte": datetime.datetime.now()
            },
            "record_type": "productAds",
            "segment": None,
            "campaign_type": "sp"
        }
    },
    {
        "$group": {
            "_id": {
                "asin": "$asin",
                "adGroupId": "$adGroupId",
                "dt": "$dt"
            },
            "impressions": {"$sum": "$impressions"},
            "clicks": {"$sum": "$clicks"},
            "spend": {"$sum": "$cost"},
            "orders": {"$sum": "$attributedConversions14d"},
            "sales": {"$sum": "$attributedSaled14d"}
        }
    },
    {
       "$sort": {
           "dt": 1
       } 
    }
    ], allowDiskUse=True)
    return products_data